<template>
  <div>
    <div class="subTitle">小游戏</div>
    <p>路由地址：<span class="code">/game</span></p>
    <p>
      本站添加了小游戏功能。一是可以丰富网站内容，二是可以作为代码练习来提升技能。<br />
      目前本站暂时只做了三个小游戏：扫雷、贪吃蛇以及俄罗斯方块。之后有空余时间的话我会更新更多的小游戏的。<br />
      小游戏的制作过程您可以在文章栏目当中查看，文章分类为小游戏分类。
    </p>
    <img
      src="@/assets/img/aboutMe/game.png"
      class="bigImg game"
      alt=""
    />
    <div class="thirdTitle">扫雷</div>
    <p>
      《扫雷》是一款大众类的益智小游戏。游戏目标是在最短的时间内根据点击格子出现的数字找出所有非雷格子，同时避免踩雷，踩到一个雷即全盘皆输。<br />
      <b>游戏规则：</b><br />
      左键单击：在判断出不是雷的方块上按下左键，可以打开该方块。如果方块上出现数字，则该数字表示其周围3×3区域中的地雷数（一般为8个格子，对于边块为5个格子，对于角块为3个格子。所以扫雷中最大的数字为8）；如果方块上为空（相当于0），则可以递归地打开与空相邻的方块；如果不幸触雷，则游戏结束。<br />
      右键单击：在判断为地雷的方块上按下右键，可以标记地雷（显示为小红旗）。重复一次或两次操作可取消标记（如果在游戏菜单中勾选了“标记(?)”，则需要两次操作来取消标雷）。<br />
    </p>
    <div class="thirdTitle">
      贪吃蛇
    </div>
    <p>
      贪吃蛇是一款经典游戏，玩家使用方向键操控一条蛇不断吞下苹果，同时蛇身随着吞下的苹果不断变长，当蛇头撞到蛇身或障壁时游戏结束。<br />
      <b>游戏规则：</b><br />
      键盘上下左右键控制小蛇的方向。
    </p>
    <div class="thirdTitle">俄罗斯方块</div>
    <p>
      俄罗斯方块是一款经典游戏，由小方块组成的不同形状的板块陆续从屏幕上方落下来，玩家通过调整板块的位置和方向，使它们在屏幕底部拼出完整的一条或几条。这些完整的横条会随即消失，给新落下来的板块腾出空间。没有被消除掉的方块不断堆积起来，一旦堆到屏幕顶端，玩家便告输，游戏结束。<br />
      <b>游戏规则：</b><br />
      键盘左右方向键控制方块左右移动，下方向键让方块加速下落，空格Space控制方块旋转。
    </p>
  </div>
</template>

<script>
export default {
  name: "games",
};
</script>

<style lang="scss" scoped>
@import "@/assets/css/aboutMe.scss";
.game{
  height: 200px;
}
</style>
